// Вам дан массив из n целых чисел nums и два массива по m целых чисел каждый, 
// l и r, представляющие m запросов диапазона, где i - й запрос представляет 
// собой диапазон[l[i], r[i]].Все массивы имеют нулевой индекс.
// Возвращает список логических элементов ответа, где ответ[i] равен true, 
// если подмассив nums[l[i]], nums[l[i] + 1], ... , nums[r[i]] можно переставить 
// для формирования арифметической последовательности и false в противном случае.

// 1630

nums = [4, 6, 5, 9, 3, 7], l = [0, 0, 2], r = [2, 3, 5];

var checkArithmeticSubarrays = function (nums, l, r) {

};


console.log(checkArithmeticSubarrays(nums, l, r))