/*
Есть заголовок односвязного списка и мы хотим удалить в нем узел узла.
Вам дан узел, который нужно удалить. Вам не будет предоставлен доступ к первому узлу головы.
Все значения связанного списка уникальны, и гарантируется, что данный узел узла не является последним узлом в связанном списке.
Удалить данный узел. Обратите внимание: под удалением узла мы не подразумеваем удаление его из памяти. Мы имеем в виду:
Значение данного узла не должно существовать в связанном списке.
Количество узлов в связанном списке должно уменьшиться на один.
Все значения перед узлом должны быть в одном порядке.
Все значения после узла должны быть в том же порядке.
Пользовательское тестирование:
Для ввода вы должны предоставить весь заголовок связанного списка и узел, которому будет присвоен узел. узел не должен быть последним узлом списка и должен быть фактическим узлом в списке.
Мы построим связанный список и передадим узел в вашу функцию.
Результатом будет весь список после вызова вашей функции.
*/

var deleteNode = function (node) {};
